# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on one-to-many and many-to-many relationships!

In [1]:
# __SOLUTION__ 
import sqlite3
import pandas as pd

## Objectives

In [2]:
# __SOLUTION__ 
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

You will be able to:
- Query data using one-to-many and many-to-many joins
- Predict the resulting size of one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

In [3]:
# __SOLUTION__ 
# Your code here
cur.execute("""select firstName, lastName, city, state
                        from employees e
                        join offices o
                        using(officeCode)
                        order by firstName asc, lastName asc;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
print('Number of results', len(df))
df.head()

Number of results 23

  firstName lastName           city state
0      Andy   Fixter         Sydney
1   Anthony      Bow  San Francisco    CA
2     Barry    Jones         London
3     Diane   Murphy  San Francisco    CA
4  Foon Yue    Tseng            NYC    NY

## Connect to the Database

In [ ]:
#Your code here

In [4]:
# __SOLUTION__ 
#Your code here
cur.execute("""select contactFirstName, contactLastName,
                      orderNumber, orderDate, status
                      from customers
                      join orders
                      using(customerNumber);""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
print('Number of results', len(df))
df.head()

Number of results 326

  contactFirstName contactLastName orderNumber   orderDate   status
0          Carine          Schmitt       10123  2003-05-20  Shipped
1          Carine          Schmitt       10298  2004-09-27  Shipped
2          Carine          Schmitt       10345  2004-11-25  Shipped
3             Jean            King       10124  2003-05-21  Shipped
4             Jean            King       10278  2004-08-06  Shipped

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [1]:
#Your code here

In [5]:
# __SOLUTION__ 
#Your code here
cur.execute("""select contactFirstName, contactLastName,
                      amount, paymentDate
                      from customers c
                      join payments
                      using(customerNumber)
                      order by amount desc;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
print('Number of results', len(df))
df.head()

Number of results 273

  contactFirstName contactLastName   amount paymentDate
0          Violeta         Benitez  9977.85  2003-11-08
1              Ben        Calaghan  9821.32  2003-10-17
2           Leslie          Taylor  9658.74  2004-12-06
3             Sean        Clenahan  9415.13  2004-07-28
4          Roland           Mendel  8807.12  2005-05-03

## Customers and their Orders (a One-to-Many join)

Return a list of all the customers first and last names along with a record for each of their order numbers, order dates and statuses.

In [2]:
# Your code here

In [6]:
# __SOLUTION__ 
#Your code here
cur.execute("""select contactFirstName, contactLastName,
                      productName, quantityOrdered, orderDate
                      from customers c
                      join orders o
                      using(customerNumber)
                      join orderdetails od
                      using(orderNumber)
                      join products p 
                      using (productCode)
                      order by orderDate desc;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
print('Number of results', len(df))
df.head()

Number of results 2996

,contactFirstName,contactLastName,productName,quantityOrdered,orderDate
0,Janine,Labrune,1962 LanciaA Delta 16V,38,2005-05-31
1,Janine,Labrune,1957 Chevy Pickup,33,2005-05-31
2,Janine,Labrune,1998 Chrysler Plymouth Prowler,28,2005-05-31
3,Janine,Labrune,1964 Mercedes Tour Bus,38,2005-05-31
4,Janine,Labrune,1926 Ford Fire Engine,19,2005-05-31

## Customers and their Payments (another One-to-Many join)

Return a list of customers first and last names along with details about their payments including the amount and date of payments. Sort these results in descending order by the payment amount.

In [3]:
# Your code here

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of customer first and last names, product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries which can make complex queries such as this much simpler!

In [4]:
# Your code here

## Summary

In this lab, you practiced your knowledge on one-to-many and many-to-many relationships!